/* 신세벌식 P2 자판배열 */
/*
12345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890
Q,        W,        E,        R,        T,        Y,        U,        I,        O,        P,
2yae3s,   2ya3l,    2ae3b,    2eo3t,    2yeo3k,   1r,       1d1dd,    1m2eu,    1ch2u,    1p2au,
2얘,      2야,      2애,      2어,      2여,      1ㄹ,      1ㄷ,      1ㅁ,      1ㅊ,      1ㅍ
3ㅅ,      3ㄹ,      3ㅂ,      3ㅌ,      3ㅋ,                1ㄸ,      2으,      2우,      2ᄋᆞ

A,        S,        D,        F,        G,        H,        J,        K,        L,        ;,        '
2yu3ng,   2ye3n,    2i3h,     2a3p,     2eu3d,    1n,       1ng,      1g1gg,    1j1jj,    1b1bb,    1t,
2유,      2예,      2이,      2아,      2으,      1ㄴ,      1ㅇ,      1ㄱ,      1ㅈ,      1ㅂ,      1ㅌ
3ㅇ,      3ㄴ,      3ㅎ,      3ㅍ,      3ㄷ,                          1ㄲ,      1ㅉ,      1ㅃ,

Z,        X,        C,        V,        B,        N,        M,        ,,        .,        /,
2au3m,    2yo3ss,   2e3g,     2o3j,     2u3ch,    1s1ss,    1h,                           1k2o
2ᄋᆞ,      2요,      2에,      2오,      2우,      1ㅅ,      1ㅎ,                          1ㅋ
3ㅁ       3ㅆ,      3ㄱ,      3ㅈ,      3ㅊ,      1ㅆ,                                    2오
*/

/* 된소리 조합 */
1d + 1d = 1dd
1g + 1g = 1gg
1j + 1j = 1jj
1b + 1b = 1bb
1s + 1s = 1ss

/* 모음 조합 */
